##########################################################################
1、Java基础，熟悉io、多线程、集合等基础框架，了解分布式、缓存、消息、搜索等机制；  
2、具备系统调优、性能调优等技能， jvm
3、对设计模式非常熟悉，有一定的实战经验，需要具备良好的建模能力，对领域模型设计了解甚佳；  
4、Spring、SpringMVC、iBatis等开源框架有应用经验者优先， 了解到它的原理和机制； 
sql优化经验；
多线程及高性能的设计与编码及性能调优；有高并发应用开发经验






//百度接口----------------

文本语音转换


//项目开发-----------------

多服务器 启动-关闭-日志-监控 批量统一配置管理系统

第三方推送平台服务器
设计跳板机 socket 路由表 路由器


#TCP/IP socket/应用层协议/mqtt/http/自己的协议@
Android 进程 jni 从底层向上 模拟系统信息 工具连点器
Android 设备控制器 - 设备socket - socketServer<net> - 终端socket
设备端 socket适配管理



//Linux-------------------------------------
Shell多进程队列同步工具
内核驱动编写test


//Java学习----------------------------------看书 Thinking in Java---------------------
#thread 并发 同步锁 几种方式
看书 通读 详细 
netyy spring 源码解析
I/O IO/NIO
JVM的性能


#ThreadLocal Context上下文 全局变量 
#线程池 - 单/多线程池队列 -> 高并发 - 定时任务调度《队列 生产者 消费者模型》
#进程通信 远程调用RPC 共享内存IPC
#classloader 注入原理 工具



//设备-------------------------------------------------------------------------------------------------
$外形造型设计
$图像流处理 传输

3d打印机
外观 组件 设计 结合传感器 和 输出 设备 ############# 


//输入
--监控 输入
指令 控制 端口 
指令 控制 行为 <移动 组合开关>

--自发输入 传感器检测 状态 监控 
录像 ##
录音 ##

光
声音
湿度
烟雾
红外


//分析 加工
--图像处理 opencv
图像视频流合成 加工 分析结果 反馈监控

--机器学习

//输出
动力
终端监控传输 图像 声音 文本

额外反馈 警报 终端 
避障碍
开关状态 传感器

 