待办 ##########################################################################

Java学习 

ThreadLocal Context 全局变量
线程池
队列
高并发
定时任务调度
进程通信 远程调用 RPC
classloader 注入原理
                                              
1！                                 ^ 3！
                                    |   设备外形设计        
                                    |   外观 组件 传感器
平面模型设计                        |   图像处理 & 机器学习
                                    |   
____________________________________|_____________________________________  
2                                   | 4！  
模型修改优化打印                    |   图像流处理 传输
                                    |   //电子元器件购买
                                    |   
                                    |   
                                    |
                                    |   
                                    |   






设备-------------------------------------------------------------------------------------------------
$外形造型设计
$图像流处理 传输

3d打印机
外观 组件 设计 结合传感器 和 输出 设备 ############# 


//输入
--监控 输入
指令 控制 端口 
指令 控制 行为 <移动 组合开关>

--自发输入 传感器检测 状态 监控 
录像 ##
录音 ##

光
声音
湿度
烟雾
红外


//分析 加工
--图像处理 opencv
图像视频流合成 加工 分析结果 反馈监控

--机器学习

//输出
动力
终端监控传输 图像 声音 文本

额外反馈 警报 终端 
避障碍
开关状态 传感器







别人的七日杀服
Steam Free PVE
IP地址： 114.215.157.248
端口：26900